app/controllers/agnieszka1s_controller.rb

SELECT "agnieszka1s".* FROM "agnieszka1s"
---
  def index
    @agnieszka1s = Agnieszka1.all

SELECT "agnieszka1s".* FROM "agnieszka1s" WHERE "agnieszka1s"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @agnieszka1 = Agnieszka1.find(params[:id])

SELECT "agnieszka1s".* FROM "agnieszka1s" WHERE "agnieszka1s"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @agnieszka1 = Agnieszka1.find(params[:id])

INSERT INTO "agnieszka1s" ("created_at", "imie", "nazwisko", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 10 Nov 2014 17:46:34 UTC +00:00], ["imie", "aga "], ["nazwisko", "nizio"], ["updated_at", Mon, 10 Nov 2014 17:46:34 UTC +00:00]]
---
  def create
    @agnieszka1 = Agnieszka1.new(params[:agnieszka1])

    respond_to do |format|
      if @agnieszka1.save